grblHAL/ESP32/main/driver.c
    DIGITAL_OUT(X_STEP_PIN, step_outbits_1.x);
    DIGITAL_OUT(Y_STEP_PIN, step_outbits_1.y);
    DIGITAL_OUT(Z_STEP_PIN, step_outbits_1.z);
#ifdef X2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits_2.x);
#endif
#ifdef Y2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits_2.y);
#endif
#ifdef Z2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits_2.z);
#endif
#ifdef A_AXIS
    DIGITAL_OUT(A_STEP_PIN, step_outbits_1.a);
#endif
#ifdef B_AXIS
    DIGITAL_OUT(B_STEP_PIN, step_outbits_1.b);
#endif
#ifdef C_AXIS
    DIGITAL_OUT(C_STEP_PIN, step_outbits_1.c);
#endif
}

#else

// Set stepper pulse output pins
inline IRAM_ATTR static void set_step_outputs (axes_signals_t step_outbits_1)
{
    axes_signals_t step_outbits_2;
    step_outbits_2.mask = (step_outbits_1.mask & motors_2.mask) ^ settings.steppers.step_invert.mask;
//    step_outbits_1.mask = (step_outbits_1.mask & motors_1.mask) ^ settings.steppers.step_invert.mask;

    if(step_outbits_1.x) {
        RMT.conf_ch[X_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[X_AXIS].conf1.tx_start = 1;
    }

    if(step_outbits_1.y) {
        RMT.conf_ch[Y_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Y_AXIS].conf1.tx_start = 1;
    }

    if(step_outbits_1.z) {
        RMT.conf_ch[Z_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Z_AXIS].conf1.tx_start = 1;
    }
#ifdef X2_STEP_PIN
    if(step_outbits_2.x) {
        RMT.conf_ch[X2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[X2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef Y2_STEP_PIN
    if(step_outbits_2.y) {
        RMT.conf_ch[Y2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Y2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef Z2_STEP_PIN
    if(step_outbits_2.z) {
        RMT.conf_ch[Z2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Z2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef A_STEP_PIN
    if(step_outbits_1.a) {
        RMT.conf_ch[A_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[A_AXIS].conf1.tx_start = 1;
    }
#endif
#ifdef B_STEP_PIN
    if(step_outbits_1.b) {
        RMT.conf_ch[B_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[B_AXIS].conf1.tx_start = 1;
    }
#endif
#ifdef C_STEP_PIN
    if(step_outbits_1.c) {
        RMT.conf_ch[C_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[C_AXIS].conf1.tx_start = 1;
    }
#endif
}

#endif

// Enable/disable motors for auto squaring of ganged axes
static void StepperDisableMotors (axes_signals_t axes, squaring_mode_t mode)
{
    motors_1.mask = (mode == SquaringMode_A || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
    motors_2.mask = (mode == SquaringMode_B || mode == SquaringMode_Both ? axes.mask : 0) ^ AXES_BITMASK;
}

#else // SQUARING DISABLED

#ifdef USE_I2S_OUT

// Set stepper pulse output pins
inline __attribute__((always_inline)) IRAM_ATTR static void i2s_set_step_outputs (axes_signals_t step_outbits)
{
    step_outbits.value ^= settings.steppers.step_invert.mask;
    DIGITAL_OUT(X_STEP_PIN, step_outbits.x);
    DIGITAL_OUT(Y_STEP_PIN, step_outbits.y);
    DIGITAL_OUT(Z_STEP_PIN, step_outbits.z);
#ifdef X2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits.x);
#endif
#ifdef Y2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits.y);
#endif
#ifdef Z2_STEP_PIN
    DIGITAL_OUT(X_STEP_PIN, step_outbits.z);
#endif
#ifdef A_AXIS
    DIGITAL_OUT(A_STEP_PIN, step_outbits.a);
#endif
#ifdef B_AXIS
    DIGITAL_OUT(B_STEP_PIN, step_outbits.b);
#endif
#ifdef C_AXIS
    DIGITAL_OUT(C_STEP_PIN, step_outbits.c);
#endif
}

#else

// Set stepper pulse output pins
inline IRAM_ATTR static void set_step_outputs (axes_signals_t step_outbits)
{
    if(step_outbits.x) {
        RMT.conf_ch[X_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[X_AXIS].conf1.tx_start = 1;
    }

    if(step_outbits.y) {
        RMT.conf_ch[Y_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Y_AXIS].conf1.tx_start = 1;
    }

    if(step_outbits.z) {
        RMT.conf_ch[Z_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Z_AXIS].conf1.tx_start = 1;
    }
#ifdef X2_STEP_PIN
    if(step_outbits.x) {
        RMT.conf_ch[X2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[X2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef Y2_STEP_PIN
    if(step_outbits.y) {
        RMT.conf_ch[Y2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Y2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef Z2_STEP_PIN
    if(step_outbits.z) {
        RMT.conf_ch[Z2_MOTOR].conf1.mem_rd_rst = 1;
        RMT.conf_ch[Z2_MOTOR].conf1.tx_start = 1;
    }
#endif
#ifdef A_STEP_PIN
    if(step_outbits.a) {
        RMT.conf_ch[A_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[A_AXIS].conf1.tx_start = 1;
    }
#endif
#ifdef B_STEP_PIN
    if(step_outbits.b) {
        RMT.conf_ch[B_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[B_AXIS].conf1.tx_start = 1;
    }
#endif
#ifdef C_STEP_PIN
    if(step_outbits.c) {
        RMT.conf_ch[C_AXIS].conf1.mem_rd_rst = 1;
        RMT.conf_ch[C_AXIS].conf1.tx_start = 1;
    }
#endif
}

#endif // RMT Stepping

#endif // SQUARING DISABLED

#ifdef GANGING_ENABLED

static axes_signals_t getGangedAxes (bool auto_squared)
{
    axes_signals_t ganged = {0};

    if(auto_squared) {
        #if X_AUTO_SQUARE
            ganged.x = On;
        #endif

        #if Y_AUTO_SQUARE
            ganged.y = On;
        #endif

        #if Z_AUTO_SQUARE
            ganged.z = On;
        #endif
    } else {
        #if X_GANGED
            ganged.x = On;
        #endif

        #if Y_GANGED
            ganged.y = On;
        #endif

        #if Z_GANGED
            ganged.z = On;
        #endif
    }

    return ganged;
}

#endif // GANGING_ENABLED

// Set stepper direction output pins
// NOTE: see note for set_step_outputs()
inline IRAM_ATTR static void set_dir_outputs (axes_signals_t dir_outbits)
{
    dir_outbits.value ^= settings.steppers.dir_invert.mask;
    DIGITAL_OUT(X_DIRECTION_PIN, dir_outbits.x);
    DIGITAL_OUT(Y_DIRECTION_PIN, dir_outbits.y);
    DIGITAL_OUT(Z_DIRECTION_PIN, dir_outbits.z);
#ifdef A_AXIS
    DIGITAL_OUT(A_DIRECTION_PIN, dir_outbits.a);
#endif
#ifdef B_AXIS
    DIGITAL_OUT(B_DIRECTION_PIN, dir_outbits.b);
#endif
#ifdef C_AXIS
    DIGITAL_OUT(C_DIRECTION_PIN, dir_outbits.c);
#endif
#ifdef GANGING_ENABLED
    dir_outbits.mask ^= settings.steppers.ganged_dir_invert.mask;
  #ifdef X2_DIRECTION_PIN
    DIGITAL_OUT(X2_DIRECTION_PIN, dir_outbits.x);
  #endif
  #ifdef Y2_DIRECTION_PIN
    DIGITAL_OUT(Y2_DIRECTION_PIN, dir_outbits.y);
  #endif
  #ifdef Z2_DIRECTION_PIN
    DIGITAL_OUT(Z2_DIRECTION_PIN, dir_outbits.z);
  #endif
#endif
}

// Sets stepper direction and pulse pins and starts a step pulse
IRAM_ATTR static void stepperPulseStart (stepper_t *stepper)
{
    if(stepper->dir_change)
        set_dir_outputs(stepper->dir_outbits);

    if(stepper->step_outbits.value) {
#ifdef USE_I2S_OUT
        uint64_t step_pulse_start_time = esp_timer_get_time();
        i2s_set_step_outputs(stepper->step_outbits);
        while (esp_timer_get_time() - step_pulse_start_time < i2s_step_length) {
            __asm__ __volatile__ ("nop");  // spin here until time to turn off step
        }
        i2s_set_step_outputs((axes_signals_t){0});
#else
        set_step_outputs(stepper->step_outbits);
#endif
    }
}

